In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame()

In [3]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
df['a']=[1,2,np.nan]

In [5]:
df

     a
0  1.0
1  2.0
2  NaN

In [7]:
df['b']=[2,np.nan,np.nan]

In [8]:
df

     a    b
0  1.0  2.0
1  2.0  NaN
2  NaN  NaN

In [9]:
df['c']=[1,2,3]

In [10]:
df

     a    b  c
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df.dropna()

     a    b  c
0  1.0  2.0  1

In [12]:
df

     a    b  c
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [13]:
df.dropna(axis=1)

   c
0  1
1  2
2  3

In [15]:
df.dropna(thresh=2) # dont delete if 2 or more nan values are present

     a    b  c
0  1.0  2.0  1
1  2.0  NaN  2

In [16]:
df

     a    b  c
0  1.0  2.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [18]:
df.fillna(0) # fill all nan values by 0

     a    b  c
0  1.0  2.0  1
1  2.0  0.0  2
2  0.0  0.0  3